{
  "projects": [{
    "id": "0",
    "tileContent": "redshield",
    "title": "RedShield (pro)",
    "dates": "january 2015 - april 2016",
    "tags": "ruby-on-rails, front-end development, devops, R&D",
    "links": [{
      "target": "https://www.redshield.co/"
     }],
    "description": "Not my own project: I was working as a Software Engineer at RedShield for a year and half.<br/>RedShield is a \"Shielding-with-a-service\" company providing a web application firewall, vulnerability scanner and analyzer to assist IT departments ensure the security of their systems."
  }, {
    "id": "1",
    "tileContent": "personal stack",
    "title": "Personal Stack",
    "dates": "2014 - today",
    "tags": "devops, docker, ansible",
    "description": "Co-owner of a dedicated server, used to manage personal services such as Gogits, Owncloud, Selfoss, Etherpad, Wallabag and websites.<br/>Running on Debian machines whose configuration has been automated with Ansible, and using Docker containers for modularity and isolation."
  }, {
    "id": "2",
    "tileContent": "cheminot.cer-sncf-bx.org",
    "title": "Front-end for SNCF's employees (pro)",
    "dates": "december 2013 - august 2014",
    "tags": "project management, ruby-on-rails, front-end development (sass, coffeescript, slim), ops, communication",
    "links": [{
      "target": "http://cheminot.cer-sncf-bx.org"
    }],
    "description": "Subject of my master thesis: build a website dedicated to SNCF’s employees.<br/>I was responsible of the whole project:<ul><li>Tasks and planning definition, resources and skills affectation to provide this new service within six months with a three person team.</li><li>Communication and product launching: define and reach targets, follow the adoption and usage of the product.</li><li>Integration within the existing information system: shared databases services management, web server deployment.</li><li>Quality management by software testing using Rspec and Capybara.</li><li>Git and Capistrano for code management and automated deployment.</li></ul>Back-end was written in Ruby-On-Rails. Front-end used Slim, SASS and CoffeeScript.<br/>The application was served by Nginx and Unicorn on an Ubuntu server. The database was PostgreSQL."
  }, {
    "id": "3",
    "tileContent": "xaviermaso.com",
    "title": "xaviermaso.com",
    "dates": "2014 - today",
    "tags": "nodejs, elm, front-end development, devops",
    "links": [{
      "target": "https://github.com/Pamplemousse/xaviermaso.com"
    }],
    "description": "The gorgeous website you are looking at right now.<br/>Front-end written in Elm, back-end powered by ExpressJS."
  }, {
    "id": "4",
    "tileContent": "meuh on air",
    "title": "MeuhOnAir",
    "dates": "december 2017",
    "tags": "python, development, ops",
    "links": [{
      "target": "https://mamot.fr/@meuhonair"
    }],
    "description": "Fan of <a target='_blank' href='http://www.radiomeuh.com/'>RadioMeuh.com</a> (French webradio), I made a Mastodon live stream of their playlist.<br/>It's Python code scrapping their playlist, comparing to what has already been published thanks to a Redis store, then calling the Mastodon API to toot what's necessary. Everything scheduled from Heroku."
  }, {
    "id": "10",
    "tileContent": "alfred",
    "title": "Alfred",
    "seriousness": "hack",
    "dates": "december 2017",
    "tags": "ruby, ops",
    "links": [{
      "target": "https://github.com/Pamplemousse/alfred"
    }],
    "description": "My very own \"personal assistant\". Even though I have great plans for him, this project is abandonned (for now...).<br/>Triggered by a text that I send to him (well, I got rid of my smartphone), all it does is scrapping my University schedule (from Autumn 2018), recognize my lectures, and send me a text back to inform me at which time and where the next one will happen.<br/>This project involve a bit of web scrapping, interacting with the Twilio api. It is written in Ruby and running on Heroku."
  }, {
    "id": "11",
    "tileContent": "owasp-top-ten",
    "title": "OwaspTopTen",
    "seriousness": "hack",
    "dates": "december 2017",
    "tags": "python, security, front-end development, ops",
    "links": [{
      "target": "https://github.com/Pamplemousse/owasp-top-10-demo"
    }],
    "description": "Challenge from \"Nuit De L’Info\" to develop an app vulnerable to the 2017 OWASP Top 10.<br/>With a team of 3 students, working a couple of hours, we developped a vulnerable app containing 10 web pages each aiming to demonstrate one of the 2017 Owasp Top Ten point. Three were fully integrated, one was in progress.<br/>It has been implemented using Flask (a Python web microframework)."
  }, {
    "id": "12",
    "tileContent": "librarybox",
    "title": "LibraryBox",
    "seriousness": "hack",
    "dates": "december 2014 - march 2015",
    "tags": "angularjs, gulp, associative entrepreneurship",
    "links": [{
      "target": "https://github.com/Labx/LibraryBox-app"
    }],
    "description": "Development of a clear an good looking web interface for <a target='_blank' href='http://librarybox.us/'>LibraryBoxes</a>. <br/>Project done in AngularJS, used Bower for libraries management and Gulp as build system."
  }, {
    "id": "13",
    "tileContent": "carrotmob",
    "title": "CarrotMob France",
    "seriousness": "hack",
    "dates": "june 2014 - september 2014",
    "tags": "nodejs stack (sailsjs, grunt, bower), associative entrepreneurship",
    "description": "Carrotmob France was a French non profit association organizing buycotts events to reward business’s commitment to making responsible social, economic and environmental changes.<br/>We were about ten persons organized to work remotely and following the Scrum method using Trello, Hangout, Skype and Github.<br/>I participated building the web-app, which front and back-end were using SailsJS, Bower, Jade and Grunt tasks."
  }, {
    "id": "14",
    "tileContent": "dice of life @ govhack",
    "title": "Loaded Dice Of Life",
    "seriousness": "hack",
    "dates": "july 2015",
    "tags": "game development, opendata",
    "links": [{
      "target": "https://github.com/LoadedDiceOfLife"
    }]
  }, {
    "id": "15",
    "tileContent": "wheredrop",
    "title": "Wheredrop",
    "seriousness": "hack",
    "dates": "april - june 2013",
    "tags": "angularjs, entrepreneurship",
    "links": [{
      "target": "https://github.com/Pamplemousse/angularjs-e-dechet"
    }],
    "description": "Lead by Gironde communities (AEC, CUB and CG33), a team of seven volunteers gathered to establish a web service which Gironde’s citizens could use to search and find places to throw their waste.<br/>The application was developed with AngularJS and served by Ruby, and is (sadly) not online anymore."
  }, {
    "id": "16",
    "tileContent": "bemydiary @ bemyapp",
    "title": "BeMyDiary",
    "seriousness": "hack",
    "dates": "november 2012 - march 2013",
    "tags": "project management, communication, entrepreneurship, opendata",
    "description": "First prize awarded in Gironde in a 48 hours hackaton with the following constraint: use open data to highlight and promote tourism of our region (Aquitaine).<br/>Organizing a team of six people, web and mobile development and finally presentating the project in front of a jury and public."
  }, {
    "id": "17",
    "tileContent": "la console @ swto",
    "title": "Startup Weekend Toulouse",
    "seriousness": "hack",
    "dates": "march 2013",
    "tags": "project management, communication, marketing, entrepreneurship"
  }, {
    "id": "18",
    "tileContent": "cooking @ imaginecup",
    "title": "CooKing",
    "seriousness": "hack",
    "dates": "december 2010 - may 2011",
    "tags": "project management, game development, communication"
  }, {
    "id": "19",
    "tileContent": "humanutty @ imaginecup",
    "title": "HumaNutty",
    "seriousness": "hack",
    "dates": "december 2012 - may 2013",
    "tags": "project management, game development, communication"
  }]
}
